IDENTIFICATION DIVISION.
PROGRAM-ID. TextToMorse.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-TEXT PIC X(100).
01 WS-MORSE PIC X(500) VALUE SPACES.
01 WS-CHAR PIC X.
01 WS-CODE PIC X(5).
01 WS-INDEX PIC 9(3) VALUE 1.
01 WS-LENGTH PIC 9(3).

01 MORSE-TABLE.
   05 FILLER PIC X(2) VALUE "A ".
   05 FILLER PIC X(5) VALUE ".-   ".
   05 FILLER PIC X(2) VALUE "B ".
   05 FILLER PIC X(5) VALUE "-... ".
   05 FILLER PIC X(2) VALUE "C ".
   05 FILLER PIC X(5) VALUE "-.-. ".
   05 FILLER PIC X(2) VALUE "D ".
   05 FILLER PIC X(5) VALUE "-..  ".
   05 FILLER PIC X(2) VALUE "E ".
   05 FILLER PIC X(5) VALUE ".    ".
   05 FILLER PIC X(2) VALUE "F ".
   05 FILLER PIC X(5) VALUE "..-. ".
   05 FILLER PIC X(2) VALUE "G ".
   05 FILLER PIC X(5) VALUE "--.  ".
   05 FILLER PIC X(2) VALUE "H ".
   05 FILLER PIC X(5) VALUE ".... ".
   05 FILLER PIC X(2) VALUE "I ".
   05 FILLER PIC X(5) VALUE "..   ".
   05 FILLER PIC X(2) VALUE "J ".
   05 FILLER PIC X(5) VALUE ".--- ".
   05 FILLER PIC X(2) VALUE "K ".
   05 FILLER PIC X(5) VALUE "-.-  ".
   05 FILLER PIC X(2) VALUE "L ".
   05 FILLER PIC X(5) VALUE ".-.. ".
   05 FILLER PIC X(2) VALUE "M ".
   05 FILLER PIC X(5) VALUE "--   ".
   05 FILLER PIC X(2) VALUE "N ".
   05 FILLER PIC X(5) VALUE "-.   ".
   05 FILLER PIC X(2) VALUE "O ".
   05 FILLER PIC X(5) VALUE "---  ".
   05 FILLER PIC X(2) VALUE "P ".
   05 FILLER PIC X(5) VALUE ".--. ".
   05 FILLER PIC X(2) VALUE "Q ".
   05 FILLER PIC X(5) VALUE "--.- ".
   05 FILLER PIC X(2) VALUE "R ".
   05 FILLER PIC X(5) VALUE ".-.  ".
   05 FILLER PIC X(2) VALUE "S ".
   05 FILLER PIC X(5) VALUE "...  ".
   05 FILLER PIC X(2) VALUE "T ".
   05 FILLER PIC X(5) VALUE "-    ".
   05 FILLER PIC X(2) VALUE "U ".
   05 FILLER PIC X(5) VALUE "..-  ".
   05 FILLER PIC X(2) VALUE "V ".
   05 FILLER PIC X(5) VALUE "...- ".
   05 FILLER PIC X(2) VALUE "W ".
   05 FILLER PIC X(5) VALUE ".--  ".
   05 FILLER PIC X(2) VALUE "X ".
   05 FILLER PIC X(5) VALUE "-..- ".
   05 FILLER PIC X(2) VALUE "Y ".
   05 FILLER PIC X(5) VALUE "-.-- ".
   05 FILLER PIC X(2) VALUE "Z ".
   05 FILLER PIC X(5) VALUE "--.. ".
   05 FILLER PIC X(2) VALUE "1 ".
   05 FILLER PIC X(5) VALUE ".---- ".
   05 FILLER PIC X(2) VALUE "2 ".
   05 FILLER PIC X(5) VALUE "..--- ".
   05 FILLER PIC X(2) VALUE "3 ".
   05 FILLER PIC X(5) VALUE "...-- ".
   05 FILLER PIC X(2) VALUE "4 ".
   05 FILLER PIC X(5) VALUE "....- ".
   05 FILLER PIC X(2) VALUE "5 ".
   05 FILLER PIC X(5) VALUE "..... ".
   05 FILLER PIC X(2) VALUE "6 ".
   05 FILLER PIC X(5) VALUE "-.... ".
   05 FILLER PIC X(2) VALUE "7 ".
   05 FILLER PIC X(5) VALUE "--... ".
   05 FILLER PIC X(2) VALUE "8 ".
   05 FILLER PIC X(5) VALUE "---.. ".
   05 FILLER PIC X(2) VALUE "9 ".
   05 FILLER PIC X(5) VALUE "----. ".
   05 FILLER PIC X(2) VALUE "0 ".
   05 FILLER PIC X(5) VALUE "----- ".
   05 FILLER PIC X(2) VALUE " ".
   05 FILLER PIC X(5) VALUE "| ".
   05 FILLER PIC X(2) VALUE ".".
   05 FILLER PIC X(5) VALUE ".-.-.- ".
   05 FILLER PIC X(2) VALUE ",".
   05 FILLER PIC X(5) VALUE "--..-- ".
   05 FILLER PIC X(2) VALUE "?".
   05 FILLER PIC X(5) VALUE "..--.. ".
   05 FILLER PIC X(2) VALUE "'".
   05 FILLER PIC X(5) VALUE ".----. ".
   05 FILLER PIC X(2) VALUE "!".
   05 FILLER PIC X(5) VALUE "-.-.-- ".
   05 FILLER PIC X(2) VALUE "/".
   05 FILLER PIC X(5) VALUE "-..-.".
   05 FILLER PIC X(2) VALUE "(".
   05 FILLER PIC X(5) VALUE "-.--.".
   05 FILLER PIC X(2) VALUE ")".
   05 FILLER PIC X(5) VALUE "-.--.-".
   05 FILLER PIC X(2) VALUE "&".
   05 FILLER PIC X(5) VALUE ".-...".
   05 FILLER PIC X(2) VALUE ":".
   05 FILLER PIC X(5) VALUE "---...".
   05 FILLER PIC X(2) VALUE ";".
   05 FILLER PIC X(5) VALUE "-.-.-.".
   05 FILLER PIC X(2) VALUE "=".
   05 FILLER PIC X(5) VALUE "-...-".
